comment_test/tsung_comment.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="Boning.eba-2ztxhtsv.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <!-- adding csv file with user-email and user-password for login -->
   <option name="file_server" id="userlist" value=".tsung/userlist.csv"/>
  </options>

  <sessions>
    
    <session name="comment_test" type="ts_http" weight="1">

      <request><http method="GET" url="/"></http></request>

      <!-- sets dynamic variables from csv list with id userlist -->
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="random">
        <var name="user_name" />
        <var name="user_email" />
        <var name="user_password" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="game_id" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="group_id" />
      </setdynvars>

      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(user_email,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_user_email" />
      </setdynvars>
     
      <!-- parses dynamic variables user_email, user_password and authenticity_token to url-encoded variables -->
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(user_email,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_user_email" />
      </setdynvars>
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(user_password,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_user_password" />
      </setdynvars>

      <!-- thinktime of user is random but between 2 and 5 seconds -->
      <thinktime random="true" min="2" max="5"/>

      <!-- for using dynamic variables the request has to be subst="true"-->
      <request subst="true">
        <!-- sets encoded dynamic variables for authenticity_token, user-email and user-password-->
        <http url='/users/sign_in' version='1.1'
          contents='authenticity_token=null&amp;user%5Bemail%5D=%%_encoded_user_email%%&amp;user%5Bpassword%5D=%%_encoded_user_password%%&amp;user%5Bremember_me%5D=0&amp;commit=Log+in'
          content_type='application/x-www-form-urlencoded'
          method='POST'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- Visit a random group page-->
      <!-- The group_id is unique for different games. So when using group_id from 1 to 1000, only use gameid: 1 -->
      <request subst="true"><http method="GET" url="/games/%%_game_id%%/groups"></http></request>
      <request subst="true"><http method="GET" url="/games/1/groups/%%_group_id%%"></http></request>

      <!-- for using dynamic variables the request has to be subst="true"-->
      <request subst="true">
          <!-- sets encoded dynamic variables for authenticity_token, comment_body-->
          <http url='/games/1/groups/%%_group_id%%/comments' version='1.1'
            contents='authenticity_token=null&amp;comment%5Bbody%5D=test&amp;commit=Save+Comment'
            content_type='application/x-www-form-urlencoded'
            method='POST'>
            <http_header name='Accept-Encoding' value='gzip, deflate' />
          </http>
      </request>

      <!-- thinktime of user is random but between 2 and 5 seconds -->
      <thinktime random="true" min="2" max="5"/>

      <!-- Visit a random user's profile -->
      <request subst="true"><http method="GET" url="/profile/%%_user_name%%"></http></request>

      <!-- for using dynamic variables the request has to be subst="true"-->
      <request subst="true">
          <!-- sets encoded dynamic variables for authenticity_token, comment_body-->
          <http url='/profile/%%_user_name%%/comments' version='1.1'
            contents='authenticity_token=null&amp;comment%5Bbody%5D=test&amp;commit=Save+Comment'
            content_type='application/x-www-form-urlencoded'
            method='POST'>
            <http_header name='Accept-Encoding' value='gzip, deflate' />
          </http>
      </request>

      <!-- for using dynamic variables the request has to be subst="true"-->
      <request subst="true">
      <!-- sets encoded dynamic variables for authenticity_token, comment_body-->
      <http url='/users/sign_out' version='1.1'
        contents='_method=delete&amp;authenticity_token=null&amp;'
        content_type='application/x-www-form-urlencoded'
        method='POST'>
        <http_header name='Accept-Encoding' value='gzip, deflate' />
      </http>
    </request>
    </session>
  </sessions>
</tsung>